<template>
    <div class="pt40">
        <mt-header :title="title"
                   fixed
                   class="mint-header-title">
            <div slot="left">
                <mt-button
                        icon="back"
                        @click="$router.go(-1)"
                ></mt-button>
            </div>
        </mt-header>
        <div class="pro-body">
            <!--<pre>-->
<!--提示条款：-->

<!--欢迎您在万才网上签署本《自由职业者服务合作协议》（下称“本协议”）。-->
<!--【审慎阅读】为维护您的自身权益，在您点击同意或书面签署本协议之前，请认真阅读本协议，务必审慎阅读、充分理解各条款内容，特别是权利义务条款、法律适用和管辖条款。上述条款以粗体及下划线标识，您应重点阅读。-->
<!--【签约】当您按照提示填写您的个人信息、阅读并同意本协议且完成全部申请或书面签署后，即表示您已充分阅读、理解并接受本协议的全部内容，此后您不得以未阅读/不理解本协议内容或类似言辞做任何形式的抗辩。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，请您立即停止任何的申请/注册/或书面签署程序。-->
<!--【承诺和保证】您系仅限于获得生产经营收入的自由职业者，您具有提供本协议服务所对应的相应资质和专业能力，您保证并确认您非下列人员：-->
<!--（1）军人、公职人员等国家法律法规和纪律规定禁止从事兼职或经商的人员；-->
<!--（2）合作方雇员等其他与合作方具有劳动/劳务合同关系或其他类似的劳动人事法律关系并从与其有前述关系的合作方取得收入薪金所得或劳务报酬所得的人员；-->
<!--（3）合作方法定代表人、股东、董事、监事等其他从合作方（含关联方）取得收入的人员。-->
<!--一经发现违反上述任一规定行为的，万才网有权上报相关主管税务机关或/及其他相关国家机关，由相关主管税务机关或/及其他相关国家机关根据《中华人民共和国税收征收管理法》及其他相关法律法规的规定追究您的法律责任。-->

<!--第一条服务内容-->
<!--1.1	因合作方服务合作需要，特选用您为合作方提供服务。您与万才网之间并不存在提供服务关系。-->
<!--1.2	您应按照万才网与合作方相关合同要求规定的标准完成任务。-->
<!--您依据本合同约定收取相关费用不违反任何法律法规和政策规定。若依据相关规定，您提供的相关服务和收费，应通过所在机构或以其他法律规定的方式进行，则您自行负责办理全部事宜，若因您的自身原因未办理前述事宜，则您应承担由此引起的全部法律后果，并赔偿由此给万才网及合作方造成的全部损失。-->
<!--第二条协议效力-->
<!--2.1	您的签约信息（包括您的姓名、身份证号等信息），以您提供的信息为准（包括但不限于线上提供或线下提供）。您承诺并保证您所提供的签约信息真实、准确。本协议条款若在万才网授权的网站上发布，自您线上点击确认之日起生效；若为书面签署，自您签署本协议之日起生效。-->
<!--2.2	本协议在发生下列情形时自然终止：-->
<!--a、经万才网或合作方事先同意的情况下，您主动退出服务的；-->
<!--b、万才网或合作方终止或变更业务模式而不需要您继续履行本协议的；-->
<!--c、万才网或合作方认为您不适合继续提供服务的；-->
<!--d、万才网和合作方解除合作的；-->
<!--e、其他原因导致本协议不再继续履行的。-->
<!--第三条万才网的权利和义务-->
<!--3.1	您应根据万才网和合作方要求提供服务，服务期间您应遵守万才网和合作方有关服务内容、服务质量等方面的要求。万才网和合作方可根据自身的运营要求制定具体安排，您应予遵守。-->
<!--3.2	按万才网或合作方的相关要求对您为合作方提供服务的成果进行验收。-->
<!--3.3	您的费用由合作方支付，且不可撤销的授权万才网代为与您进行结算。-->
<!--3.4	您确认，您签署本协议并不导致您与万才网举办者以及合作方之间构成劳动关系/劳务/雇佣关系，且万才网和合作方对您违反任何法律法规的行为不承担任何法律责任。-->
<!--3.5 您同意，您不可撤销地授权万才网和合作方有权为提供前述费用结算服务的需要获取您的相关信息（包括但不限于个人身份信息、实名登记手机号码、银行账户相关信息等），并将您的相关信息提交第三方机构进行身份验证。若您提供任何错误、虚假、失效或不完整的资料，或者万才网或合作方有合理的理由怀疑资料为错误、虚假、过期或不完整，万才网或合作方有权暂停或终止向您提供部分或全部服务，对此万才网或合作方不承担任何责任，您承诺并同意负担因此所产生的所有损失，包括但不限于直接损失、间接损失。若因国家法律法规、部门规章或监管机构的要求，万才网或合作方需要您补充提供任何相关资料时，如您不能及时配合提供，万才网或合作方有权暂停或终止向您提供部分或全部服务。-->
<!--第四条您的权利和义务-->
<!--4.1	您应按时尽责地完成万才网以及合作方要求的任务内容，并达到规定的质量标准，不得有侵犯他人知识产权、财产权、人身权、肖像权、隐私权、商业秘密或其他合法权益以及其他违反国家法律法规、国家政策、或有悖于公序良俗的内容。-->
<!--4.2 协议期内，您应在万才网以及合作方许可范围内使用本合同有关的商业信息；协议期内以及协议终止后，您均有义务对双方合作的有关协议及合作过程中知悉的万才网、合作方的相关信息予以保密，未经书面许可，您不得以任何方式向其它方披露、给予或转让该等保密信息。否则，因此导致万才网及/或合作方或其关联公司的损失，由您负责赔偿。-->
<!--4.3	除本协议事项外，您不能以万才网及/或合作方的名义开展任何与完成约定的任务无关的业务或活动。-->
<!--4.4 您保证活动过程中遵守国家法律法规，不得从事违反法律及行政法规等行为（包括但不限于涉嫌洗钱、偷税、漏税、逃税）。-->
<!--4.5 您充分理解自由职业者的定义，并承诺不存在下列所述情形：-->
<!--4.5.1与合作方（含关联方）具有劳动/劳务合同关系或其他类似的劳动人事法律关系；-->
<!--4.5.2为合作方（含关联方）的法定代表人、股东、董事、监事；-->
<!--4.5.3军人、公职人员等国家法律法规和纪律规定禁止从事兼职或经商的人员；-->
<!--4.5.4其他不适用于本协议本协议服务范围之规定的人员。-->
<!--4.6  您保证向万才网提供的信息均是真实的、有效的、合法的，如信息发生变更（例如，不再是自由职业者身份时）应及时通知万才网，否则因此造成的一切不利后果由您承担。您账户信息以您实名提交至万才网后台的信息为准，且您保证该账户为纳税义务人所有。自万才网将应支付的生产经营收入支付至您账户之日起，视为您收到前述费用。如因您提供信息有误导致付款失败的，您独自承担相应责任。您承诺其使用所提供的账户应符合中华人民共和国法律的规定，如果万才网收到万才网主管税务机关或/及其他相关国家机关任何调查请求的，您应提供协助并如实反映情况。-->
<!--4.7 您应自行负担就其取得的生产经营收入需缴纳的各项税款，并委托万才网按照有关税收政策规定及主管税务机关的要求向您代征个人所得税税款。应万才网要求，您应提供与税款申报缴纳相关的协助及信息。如果您拒绝提供相关协助或信息的，万才网有权暂缓代为支付您的生产经营收入。-->
<!--第五条服务费用的支付-->
<!--5.1	万才网根据服务标准及收费标准以及您的服务情况代合作方向您支付服务费用。-->
<!--您应向万才网提供以您本人实名注册的对应账户信息，以及相关必要的证件。若具体账户信息在指定的平台在线提供的，以您在线提供的信息为准。-->
<!--您同意并授权万才网及/或合作方与第三方机构就您的服务费用的支付签署资金托管协议。-->
<!--5.2	万才网服务费用支付以您提供的收款帐户为准，因您提供的收款帐户不实造成的一切损失由您自行承担。如您帐号变更或发生不可用等情况时，应及时书面通知万才网或在万才网指定的网络平台进行变更操作，否则，由此造成的一切损失由您自行负责。-->
<!--5.3	万才网不承担您任何社保福利待遇，也不负责您的任何医疗保险费用。-->
<!--第六条违约责任-->
<!--6.1	各方应按本协议约定履行，如有违反，守约方有权要求对方及时改正；造成对方损失的，守约方有权要求违约方赔偿。-->
<!--6.2	因不可抗力造成损失的，彼此不负赔偿责任，但发生不可抗力一方应及时将有关情况通知另一方，并尽最大努力进行补救。本协议所称不可抗力是指不能预见、不能克服并不能避免且对一方当事人造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、火灾和风暴等以及社会事件如战争、动乱、政府行为、黑客事件、大范围电信事故等。-->
<!--第七条协议的终止-->
<!--7.1	发生以下情形时，本协议终止：-->
<!--•	协议期限届满或任何一方提前30日书面通知对方要求终止协议的，但您要求终止协议应事先获得万才网和合作方的同意并不得影响万才网和合作方的运营；-->
<!--•	一方违反协议约定，且违约方在守约方书面通知后15日内仍未予改正的，守约方可以书面通知的形式解除本协议；-->
<!--•	您如未能达到万才网和合作方的要求，万才网或合作方在任务验收时将给予警告；此后如仍发生类似情况的，万才网或合作方可提前解除本协议。-->
<!--第八条协议的变更与终止-->
<!--8.1 万才网有权根据需要不时地修改本协议条款或规则（包括发布新规则），并在万才网及其APP、小程序上予以公布，修改后的条款或规则对您具有约束力。-->
<!--8.2 您应遵守本协议约定及相关法律法规的规定，万才网有权自主判断您的行为是否违约或/及违规。万才网如有合理理由或有证据认定您违反本协议或任何法律法规的，有权在无需事先通知您的情况之下，限制、停止或取消您使用万才网平台服务的资格。-->
<!--第九条其他-->
<!--9.1	因履行本协议发生的纠纷，应友好协商解决，协商不成的，提请万才网所在地有管辖权的人民法院管辖解决。-->
<!--9.2	万才网和合作方有权根据业务需要修改本协议条款。-->
<!--9.3 除本协议另有约定外，在履行本协议过程中的一切通知，万才网均可通过网页公告、电子邮件、系统通知、短信提醒或其他合理方式进行，该等通知于发送之日视为已送达收件人。-->
<!--9.4本协议所称万才网的主体为万才网的举办者万才科技（杭州）有限公司，如涉及所在地等确定等，均以万才科技（杭州）有限公司为准。-->
<!--签署声明-->
<!--您已经充分知悉且已理解本协议全部內容，保证网络流程操作者已获有效授权并足以代表自己或者授权人订立本协议。-->
            <!--</pre>-->
            <div v-html="msg"></div>
        </div>
    </div>
</template>

<script>
    export default {
        name: "",
        components: {},
        data() {
            return {
                msg:"",
                type:'',
                title:'',
            }
        },
        mounted(){
            this.type = this.$route.query.type;
            this.getUserAgreement()
        },
        methods: {
            getUserAgreement(){
                let _this = this;
                this.$api.userAgreement({}).then(res=>{
                    if(res.data.respCode == 0){
                        let result = Array.from(res.data.data);
                        for(let item of result){
                            if(item.title.includes('平台自由职业者') && _this.type == '1'){
                                _this.msg = item.content;
                                _this.title = item.title;
                            }
                            if(item.title.includes('隐私权规定') && _this.type == '2'){
                                _this.msg = item.content;
                                _this.title = item.title;
                            }
                            if(item.title.includes('万才平台注册服务') && _this.type == '3'){
                                _this.msg = item.content;
                                _this.title = item.title;
                            }
                            if(item.title.includes('班务经理服务') && _this.type == '4'){
                                _this.msg = item.content;
                                _this.title = item.title;
                            }
                            if(item.title.includes('安防协议') && _this.type == '5'){
                                _this.msg = item.content;
                                _this.title = item.title;
                            }
                        }
                    }
                    console.log(res);
                })
            }
        }
    }
</script>

<style lang="scss">
    .pt40{
        padding-top: 40px;
    }
    .pro-body{
        padding:0.75rem;
        word-break: break-all;
        white-space: pre-line;
        text-align: justify;
        line-height:1.8;
        pre{
            word-break: break-all;
            white-space: pre-line;
            text-align: justify;
            line-height:1.8;
        }
    }
</style>